

# Пользователь вводит свой возраст. Если ему меньше 18 — напиши “Доступ запрещён”, иначе “Добро пожаловать!”.



# Пользователь вводит строку. Если в ней есть слово "Python", выведи "Да, ты любишь Python!", иначе "Попробуй изучить его!".



# Пользователь вводит число. Выведи, чётное оно или нечётное.

# num_1 = int(input("Number: "))

# if num_1 % 2 == 0:
#     print("Good")
# else:
#     print("NOT GOOD") 
# 

   # Пользователь вводит два числа. Определи, какое из них больше, или выведи, что они равны.

# age = int(input("Your age: "))
# adult = 18

# if age < adult:
#     print("Young")
# else:
#     print("Adult")    

# Пользователь вводит оценку от 1 до 5. Напиши программу, которая выведет, что это значит (1 — плохо, 5 — отлично и т.д.).

# grade = int(input("Input grade: "))

# if grade == 1:
#     print("Sorry")
# elif grade == 2:
#     print("We try")
# elif grade == 3:
#     print("Fair")
# elif grade == 4:
#     print("Good")
# elif grade == 5:
#     print("Excelent")
# else:                    
#     print("grade not found")


# ----------------------------

# Выведи все числа от 1 до 10.

# Выведи таблицу умножения на 5.

# Пользователь вводит строку — выведи каждый символ отдельно.

# Посчитай сумму всех чисел от 1 до 100.

# Есть список ["яблоко", "банан", "вишня"]. Выведи каждый элемент с текстом "Я люблю <фрукт>".

# for i in range(1, 11):
#     print(i)


# for i in range(1):
#     num = int(input("Number: "))
# print("Result is:", num * 5)    