# 1.Створіть список на основі введеної послідовності цілих чисел і надрукуйте другу половину списку. Якщо кількість не парна, то вивести більшу кількість.

# 2.Створіть список на основі введеної послідовності цілих чисел і надрукуйте його елементи таким чином: два останні елементи переміщені з кінця в початок списку без зміни їх початкового порядку.

# 3.Збережіть назви мов світу, які вводяться в одному рядку через пропуск, у списку. Простежте за тим, щоб елементи у списку не зберігались в алфавітному порядку. Відсортуйте список в алфавітному порядку і виведіть його елементи в рядку через пропуск.

# 4.Виведіть елементи списку в зворотному порядку, не змінюючи сам список.

# 5.Виведіть всі елементи списку з парними індексами. Вводиться список чисел. Всі числа списку знаходяться на одному рядку.

# 6.Визначте, скільки різних слів у введеному рядку.

# 1

# numbers = (input("Enter numbers:"))
# numbers = numbers.split()
# numbers = [int(i) for i in numbers]

# n = len(numbers)
# middle = (n + 1) // 2 #n = 5 → (5 + 1) // 2 = 6 // 2 = 3 # // делит и округляет вниз. Добавив +1, мы сдвигаем середину на 1, если длина нечётная, и получаем большую вторую половину.

# second_half = numbers[middle:] # numbers[middle:] — это всё от middle до конца списка.

# print(second_half)


# 2

# numbers = input("Number:").split()
# numbers = [int(i) for i in numbers] #переносим просто в числа через int
# numbers = numbers[-2:] + numbers[:-2] ## соедение по сути но немного задом наперед

# print(numbers)

# 3

# states_names = ["english", "deutch", "french"]

# sorted_names = sorted(states_names)

# print(sorted_names)

# 4

# nums = [1, 2, 3, 4, 5]

# for el in reversed(nums):
#     print(el)

# 5

# numbers = list(map(int, input("enter:").split()))
# for i in range(0, len(numbers), 2):
#     print(numbers[i], end="")

# 6

# text = input("Enter:")
# words = text.split()
# print(len(set(words)))




















