# Дано рядок, що складається з n цифр (тобто одноцифрових чисел), між якими стоїть n-1 знаків операцій, кожна з яких може бути або +, або -. Обчисліть значення цього виразу. Програма має надрукувати результат обчислення цього виразу.

# ex = input("Enter ex:\n") # 5-3+1
# # len_ex = len(ex) #5

# n = (len(ex) + 1) // 2 #тоже самое что и int но вместо него //

# # ex[::2].split("")

# # print(int(ex[0]) + (1 if ex[1] == "+" else -1) * int(ex[2]) + (1 if ex[3] == "+" else -1) * int(ex[4]))

# # ex.replace("-", "+")


# # var 2

# sum = int(ex[0])
# for i in range (len(ex)):
    
#     int(ex[0]) + (1 if ex[1] == "+" else -1) * int(ex[2]) + (1 if ex[3] == "+" else -1) * int(ex[4])
1